tutorials/multiphase/cavitatingFoam/RAS/throttle/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     cavitatingFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.002;

deltaT          1e-08;

writeControl    adjustableRunTime;

writeInterval   0.0001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           0.5;

maxAcousticCo   50;


// ************************************************************************* //
